In [211]:
phrase = "I'm will" # String
print(phrase)

I'm will

In [212]:
x = 5 # Integer
y = 10
z = x + y # plus

z = y / x # divide




j = type(z)
print(j)

<class 'float'>

In [213]:
# In this cell, initialise two numeric variables and find their product using the * 
# operator for multiplication and assign this to a new variable.
# Print the new variable

# The radius of a circle is 2, assume that Pi is 3.14. Assign both of these to suitably named 
# variables and find the area of the circle.
# We can find the area of a circle by finding the product of Pi with the radius squared.
# You probably don't know how to square a number in Python yet, so use Google to work it out!

r = 2
pi = 3.14
area = pi * (r**2)
print(area)

12.56

In [214]:
name = 'Will LP'
hobby = 'running'
long_string = 'My name is ' + name + ' and my hobby is ' + hobby
# print(long_string)

phrase = f"My name {name} is and my hobby is {hobby}"
print(phrase)

My name Will LP is and my hobby is running

In [215]:
# In this cell, initialise two appropriately named variables, one for your name and one for your job title.
# Next, combine them in an f string, assigned to a different, appropriately named variable.
# Finally, print the f string.

In [216]:
#print(len(phrase))

string_slice = phrase[3:15]
# print(string_slice)

filename = 'here_is_a_file.csv'
filename = filename[:-4]
print(filename)

here_is_a_file

In [217]:
# In this cell I've initialised a variable 'slice_this_phrase'. 
# On the next three lines, print the words dog, cat, and racoon seprately using a slice 
# from the beginning, a slice giving a range in the middle, and a slice from the end.
# This means one slice will involve [:n], one will involve [n1:n2], and one will involve [-n:].

slice_this_phrase = 'dog cat racoon'

animal_1 = slice_this_phrase[:3]
animal_2 = slice_this_phrase[4:7]
animal_3 = slice_this_phrase[-6:]

print(f'{animal_1} {animal_2} {animal_3}')

dog cat racoon

In [218]:
list_1 = [1, 2, 3, x, y]
print(list_1)

[1, 2, 3, 5, 10]

In [219]:
favourite_colour = 'teal'
colours_list = ['red', 'blue', 'green']
colours_list.append(favourite_colour)


print(f'My colours are: {colours_list}')

My colours are: ['red', 'blue', 'green', 'teal']

In [220]:
# In this cell, make a list of a few foods and print it.
# Then extend the list with another food and print it.

In [221]:
colours_list = ['red', 'blue', 'green', 'teal']
print(colours_list)
more_colours = ['white', 'grey']
# colours_list.append(more_colours)
# print(colours_list)
colours_list.extend(more_colours)
print(colours_list)

#colours_list.remove(['white', 'grey'])
print(colours_list)

['red', 'blue', 'green', 'teal']
['red', 'blue', 'green', 'teal', 'white', 'grey']
['red', 'blue', 'green', 'teal', 'white', 'grey']

In [222]:
# Next, make another list of foods, and use the extend method to add those extra foods as individual elements of the list, 
# and print it.
# Finally, remove and element from the list and print the final list.
# Remember to always use a suitable name for your lists!

In [223]:
numbers_list = [2, 3, 4, 5, 1, 6]
numbers_list.sort()
print(numbers_list)
numbers_list.sort(reverse=True)
print(numbers_list)

numbers_list = [2, 3, 4, 5, 1, 6]
sorted_numbers = sorted(numbers_list)
print(sorted_numbers)

colours_list = ['red', 'blue', 'green', 'teal']
colours_list_sorted = sorted(colours_list)
colours_list_sorted.reverse()
print(colours_list_sorted)

[1, 2, 3, 4, 5, 6]
[6, 5, 4, 3, 2, 1]
[1, 2, 3, 4, 5, 6]
['teal', 'red', 'green', 'blue']

In [224]:
# In this cell, use the sorted method on your final list of foods to sort it alphabetically and print it.
# Now use the documentation here to sort in reverse order: https://docs.python.org/3/library/functions.html#sorted

In [225]:
favourite_colours_dict = {'will':'purple',
                     'scout':['yellow', 'red'],
                     'crash':23,
                     'Naiomi':{'Monday':'Purple',
                               'EOD':'Yellow'}}
print(favourite_colours_dict)
print(favourite_colours_dict['Naiomi'])
print(favourite_colours_dict.keys())
print(favourite_colours_dict.values())
print(favourite_colours_dict.items())

{'will': 'purple', 'scout': ['yellow', 'red'], 'crash': 23, 'Naiomi': {'Monday': 'Purple', 'EOD': 'Yellow'}}
{'Monday': 'Purple', 'EOD': 'Yellow'}
dict_keys(['will', 'scout', 'crash', 'Naiomi'])
dict_values(['purple', ['yellow', 'red'], 23, {'Monday': 'Purple', 'EOD': 'Yellow'}])
dict_items([('will', 'purple'), ('scout', ['yellow', 'red']), ('crash', 23), ('Naiomi', {'Monday': 'Purple', 'EOD': 'Yellow'})])

In [226]:
# In this cell, make a dicitonary of some restaurants and the foods they sell, print the items, keys, and values, have at least 
# one have the value as a list.
# print out one set of values accessing them using the key.

In [227]:
favourite_colours_dict = {'will':'purple',
                     'scout':['yellow', 'red'],
                     'crash':23,
                     'Naiomi':'orange'
                     }



print(favourite_colours_dict)

print('Orange' in favourite_colours_dict)

{'will': 'purple', 'scout': ['yellow', 'red'], 'crash': 23, 'Naiomi': 'orange'}
False

Make a dictionary which has the names of everyone in the group as keys, and job titles as the values, print it. When everyone has a working version, work out how to get all of the values from the dictionary as a single list, and sort the new list alphabetically, assigned to a suitably named variable.

You have probably not used for loops before, and actually that is a topic for a later session, if you have used for loops, help guide rather than instruc the rest of your group. I would like you to use google as your main resource to work out how to use a for loop to print each set of keys/values from your dictionary on new lines, one line per loop, with the resulting form 'My name is and my job is '. The point of this exercise isn't the answer, the point of this exercise is learning how to use online resources to search for an answer and translate the answer from those resources into your own work.

In [228]:
job_dict = {'Will':'Instructing',
             'Emily':'Performance Analyst',
             'Jon': 'Performance M.',
             'Emma': 'Perf. O.',
             'Paul M': 'Perf. O.',
             'Michael M': 'Regional M.',
             'Alasdair':'SQL Dev.',
             'Michael C': 'Analyst',
             'Paul D': 'Senior Perf. M.',
             'Nazahah': 'Analyst',
             'Martin H':'SQL Dev.'}
names = list(job_dict.keys())
names_sorted = sorted(names)
print(names_sorted)

for key, val in job_dict.items():
    # print the key
    print(f"My name is {key}, my job is {val}.")

['Alasdair', 'Emily', 'Emma', 'Jon', 'Martin H', 'Michael C', 'Michael M', 'Nazahah', 'Paul D', 'Paul M', 'Will']
My name is Will, my job is Instructing.
My name is Emily, my job is Performance Analyst.
My name is Jon, my job is Performance M..
My name is Emma, my job is Perf. O..
My name is Paul M, my job is Perf. O..
My name is Michael M, my job is Regional M..
My name is Alasdair, my job is SQL Dev..
My name is Michael C, my job is Analyst.
My name is Paul D, my job is Senior Perf. M..
My name is Nazahah, my job is Analyst.
My name is Martin H, my job is SQL Dev..

In [229]:
# git add .
# git status
# git commit -m "sensible message"
# git push origin HEAD

In [230]:
import pandas as pd

dict_1 = {"here's a column":['val 1', 'val 2', 'val 3'],
          "col 2":[4, 5, 6],
          "col z":['foo', 'bar', 'baz']}

df_1 = pd.DataFrame(dict_1)
print(df_1)

  here's a column  col 2 col z
0           val 1      4   foo
1           val 2      5   bar
2           val 3      6   baz

In [231]:
list_of_dicts = [{'letter':'A',
                  'word':'foo',
                  'number':1},
                  {'letter':'B',
                  'word':'bar',
                  'number':2},
                  {'letter':'C',
                  'word':'baz',
                  'number':3}]

df_2 = pd.DataFrame(list_of_dicts)
df_2

  letter word  number
0      A  foo       1
1      B  bar       2
2      C  baz       3

In [232]:

# Make sure you have Pandas imported as pd.
# Using dictionaries and the pd.DataFrame method (remember the capitals) make a dataframe of a few employees at an imaginary company with the columns: 
# name, salary, and job title.
# Name the dataframe something sensible.
# For a later exercise, ensure every employess has a first and last name seperated by a space.
# Print it!

In [233]:
corporation = [{'Name':'Will LP',
                'Salary':'10000',
                'Job Title':'Employee'},
                {'Name':'Annie LP',
                'Salary':'15000',
                'Job Title':'Boss'},
                {'Name':'Andy LP',
                'Salary':'9000',
                'Job Title':'Cleaner'}]

corp_df = pd.DataFrame(corporation)
corp_df

       Name Salary Job Title
0   Will LP  10000  Employee
1  Annie LP  15000      Boss
2   Andy LP   9000   Cleaner

In [234]:
# print(corp_df.info())
print(corp_df.dtypes)
# print(corp_df.head(1))
# print(corp_df.tail(1))

Name         object
Salary       object
Job Title    object
dtype: object

In [235]:
corp_df['Salary'] = corp_df['Salary'].astype('int')
corp_df.dtypes

Name         object
Salary        int64
Job Title    object
dtype: object

In [236]:
corp_salary_tot = corp_df['Salary'].sum()
corp_salary_mean = corp_df['Salary'].mean()
corp_salary_cumsum = corp_df['Salary'].cumsum()
sal_min_max = f"Salary minimum: {corp_df['Salary'].min()}, salary maximum: {corp_df['Salary'].max()}"
print(sal_min_max)

Salary minimum: 9000, salary maximum: 15000

In [237]:
corp_df['Date Started'] = ['05/12/1993', '01/01/2000', '01/01/2020']
corp_df

       Name  Salary Job Title Date Started
0   Will LP   10000  Employee   05/12/1993
1  Annie LP   15000      Boss   01/01/2000
2   Andy LP    9000   Cleaner   01/01/2020

In [238]:
inflation = 1.067
corp_df['Salary'] = corp_df['Salary'] * inflation

corp_df['Pay After Bonus'] = corp_df['Salary'] + 500
corp_df['Salary'] = corp_df['Salary'].astype(int)
corp_df

       Name  Salary Job Title Date Started  Pay After Bonus
0   Will LP   10670  Employee   05/12/1993          11170.0
1  Annie LP   16005      Boss   01/01/2000          16505.0
2   Andy LP    9603   Cleaner   01/01/2020          10103.0

In [239]:
corp_df['Date Started'] = ['05/12/1993', '01/01/2000', '01/01/2020']
corp_df

corp_df['Date Started'] = pd.to_datetime(corp_df['Date Started'], format='%d/%m/%Y')
corp_df

       Name  Salary Job Title Date Started  Pay After Bonus
0   Will LP   10670  Employee   1993-12-05          11170.0
1  Annie LP   16005      Boss   2000-01-01          16505.0
2   Andy LP    9603   Cleaner   2020-01-01          10103.0

In [240]:
# Create a column for each employee with their birthday in day month year format
# convert it to datetime, using format='%d/%m/%Y'
# print it
# add another column to work out how long each employee has been at the company called 'Time Served'
# df[new column] = pd.to_datetime('06/11/2023, format='%d/%m/%Y') - df[date started]

In [241]:
corp_df['Time Served'] = pd.to_datetime('06/11/23', format='%d/%m/%y') - corp_df['Date Started']
corp_df['Time Served'] = corp_df['Time Served'] / pd.Timedelta('365 days')
corp_df['Time Served'] = corp_df['Time Served'].round().astype('int', errors='ignore')
corp_df

       Name  Salary Job Title Date Started  Pay After Bonus  Time Served
0   Will LP   10670  Employee   1993-12-05          11170.0           30
1  Annie LP   16005      Boss   2000-01-01          16505.0           24
2   Andy LP    9603   Cleaner   2020-01-01          10103.0            4

Make a dataframe
Use a list of dicitonaries to make it, and the pd.DataFrame() class

In [242]:
import pandas as pd

In [243]:
df = pd.DataFrame([{'Restaurant':"Will's Cafe",
                    'Starter':'Chips',
                    'Main':'Chips',
                    'Dessert':'Chips'},
                    {'Restaurant':"Crash's Cafe",
                    'Starter':'Kibble',
                    'Main':'Kibble',
                    'Dessert':'Chicken and rice'}])
print(df)

     Restaurant Starter    Main           Dessert
0   Will's Cafe   Chips   Chips             Chips
1  Crash's Cafe  Kibble  Kibble  Chicken and rice

In [244]:
corporation = [{'Name':'Will LP',
                'Salary':'10000',
                'Job Title':'Employee'},
                {'Name':'Annie LP',
                'Salary':'15000',
                'Job Title':'CEO'},
                {'Name':'Naiomi LP',
                'Salary':'90000',
                'Job Title':'VP'},
                {'Name':'Luke V',
                'Salary':'45000',
                'Job Title':'Teach Lead'},
                {'Name':'Matt K',
                'Salary':'30000',
                'Job Title':'Comms'},
                {'Name':'Hannah K',
                'Salary':'38000',
                'Job Title':'HR'},]

corp_df = pd.DataFrame(corporation)


corp_df['Date Started'] = ['05/12/1993', '01/01/2000', '01/01/2020', '23/12/1989', '10/10/2010', '17/12/2021']

corp_df['Date Started'] = pd.to_datetime(corp_df['Date Started'], format='%d/%m/%Y')

corp_df

        Name Salary   Job Title Date Started
0    Will LP  10000    Employee   1993-12-05
1   Annie LP  15000         CEO   2000-01-01
2  Naiomi LP  90000          VP   2020-01-01
3     Luke V  45000  Teach Lead   1989-12-23
4     Matt K  30000       Comms   2010-10-10
5   Hannah K  38000          HR   2021-12-17

In [245]:
corp_df['Salary'] = corp_df['Salary'].astype('int')
print(corp_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          6 non-null      object
 1   Salary        6 non-null      int64
 2   Job Title     6 non-null      object
 3   Date Started  6 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 320.0+ bytes
None

In [246]:
corp_df['Raise amount'] = 1.1
corp_df

        Name  Salary   Job Title Date Started  Raise amount
0    Will LP   10000    Employee   1993-12-05           1.1
1   Annie LP   15000         CEO   2000-01-01           1.1
2  Naiomi LP   90000          VP   2020-01-01           1.1
3     Luke V   45000  Teach Lead   1989-12-23           1.1
4     Matt K   30000       Comms   2010-10-10           1.1
5   Hannah K   38000          HR   2021-12-17           1.1

In [247]:
corp_df['Date Started'] = ['05/12/1993', '01/01/2000', '01/01/2020', '23/12/1989', '10/10/2010', '17/12/2021']

corp_df['Date Started'] = pd.to_datetime(corp_df['Date Started'], format='%d/%m/%Y')

corp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          6 non-null      object
 1   Salary        6 non-null      int64
 2   Job Title     6 non-null      object
 3   Date Started  6 non-null      datetime64[ns]
 4   Raise amount  6 non-null      float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 368.0+ bytes

In [248]:
corp_df

        Name  Salary   Job Title Date Started  Raise amount
0    Will LP   10000    Employee   1993-12-05           1.1
1   Annie LP   15000         CEO   2000-01-01           1.1
2  Naiomi LP   90000          VP   2020-01-01           1.1
3     Luke V   45000  Teach Lead   1989-12-23           1.1
4     Matt K   30000       Comms   2010-10-10           1.1
5   Hannah K   38000          HR   2021-12-17           1.1

In [249]:
import pandas as pd

child_info = pd.DataFrame([{'Child_ID':'child1',
                            'Gender':'0',
                            'DOB':'05/05/2015',
                            'Ethnicity':'BANG',
                            'PLACE':'P1'},
                            {'Child_ID':'child2',
                            'Gender':'1',
                            'DOB':'12/12/2020',
                            'Ethnicity':'WOTH',
                            'PLACE':'T1'},
                            {'Child_ID':'child3',
                            'Gender':'2',
                            'DOB':'01/01/2000',
                            'Ethnicity':'MOTH',
                            'PLACE':'T1'},
                            {'Child_ID':'child4',
                            'Gender':'7',
                            'DOB':'09/12/2017',
                            'Ethnicity':'BANG',
                            'PLACE':'W1'},
                            ])

child_info['DOB'] = pd.to_datetime(child_info['DOB'], format='%d/%m/%Y')

child_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Child_ID   4 non-null      object
 1   Gender     4 non-null      object
 2   DOB        4 non-null      datetime64[ns]
 3   Ethnicity  4 non-null      object
 4   PLACE      4 non-null      object
dtypes: datetime64[ns](1), object(4)
memory usage: 288.0+ bytes

In [250]:
corporation = [{'Name':'Will LP',
                'Salary':'10000',
                'Job Title':'Employee'},
                {'Name':'Annie LP',
                'Salary':'15000',
                'Job Title':'CEO'},
                {'Name':'Naiomi LP',
                'Salary':'90000',
                'Job Title':'VP'},
                {'Name':'Luke V',
                'Salary':'45000',
                'Job Title':'Teach Lead'},
                {'Name':'Matt K',
                'Salary':'30000',
                'Job Title':'Comms'},
                {'Name':'Hannah K',
                'Salary':'38000',
                'Job Title':'HR'},]

corp_df = pd.DataFrame(corporation)


corp_df['Date Started'] = ['05/12/1993', '01/01/2000', '01/01/2020', '23/12/1989', '10/10/2010', '17/12/2021']

corp_df['Date Started'] = pd.to_datetime(corp_df['Date Started'], format='%d/%m/%Y')

corp_df['Salary'] = corp_df['Salary'].astype('int')

corp_df

        Name  Salary   Job Title Date Started
0    Will LP   10000    Employee   1993-12-05
1   Annie LP   15000         CEO   2000-01-01
2  Naiomi LP   90000          VP   2020-01-01
3     Luke V   45000  Teach Lead   1989-12-23
4     Matt K   30000       Comms   2010-10-10
5   Hannah K   38000          HR   2021-12-17

In [251]:
# Equals ==
# Not equals !=
# less than <
# greater than >
# greater or equal >=
# less or equal <=
# ~ not


mask = corp_df['Salary'] > 40000

over_40k = corp_df[mask]
under_40k = corp_df[~mask]
under_40k

mask = corp_df['Salary'] > corp_df['Salary'].mean()
over_mean = corp_df[mask]

ceo_df = corp_df[corp_df['Job Title'] == 'CEO']
not_ceo_df = corp_df[corp_df['Job Title'] != 'CEO']

nepo_df = corp_df[corp_df['Name'].str.contains('LP')]

some_jobs = corp_df[corp_df['Job Title'].isin(['CLeaner', 'Site Manager'])]
some_jobs

Empty DataFrame
Columns: [Name, Salary, Job Title, Date Started]
Index: []

In [252]:
mask = child_info['Gender'] == '7'
wrong_gender_codes = child_info[mask]
print(wrong_gender_codes)

correct_gc = child_info[~mask]
print(correct_gc)

incorrect_eth = child_info[child_info['Ethnicity'] == 'BANG']
print(incorrect_eth)

correct_eth = child_info[child_info['Ethnicity'] != 'BANG']
print(correct_eth)

  Child_ID Gender        DOB Ethnicity PLACE
3   child4      7 2017-12-09      BANG    W1
  Child_ID Gender        DOB Ethnicity PLACE
0   child1      0 2015-05-05      BANG    P1
1   child2      1 2020-12-12      WOTH    T1
2   child3      2 2000-01-01      MOTH    T1
  Child_ID Gender        DOB Ethnicity PLACE
0   child1      0 2015-05-05      BANG    P1
3   child4      7 2017-12-09      BANG    W1
  Child_ID Gender        DOB Ethnicity PLACE
1   child2      1 2020-12-12      WOTH    T1
2   child3      2 2000-01-01      MOTH    T1

In [254]:
df = child_info

moth_woth = df[df['Ethnicity'].str.lower().isin(['moth', 'woth'])]
moth_woth

  Child_ID Gender        DOB Ethnicity PLACE
1   child2      1 2020-12-12      WOTH    T1
2   child3      2 2000-01-01      MOTH    T1